<template>
  <div class="about">
    <div class="help">
      <h1>配置说明</h1>
      <hr />
      <h2>启用配置</h2>
      <p>如果不启用，则告警的时候消息通知不会针对这条配置进行处理。</p>
      <h2>关键字过滤</h2>
      <p>以下都是在启用配置的情况下：</p>
      <p>
        告警的时候，会将告警信息与提供的关键字进行匹配，如果信息中包含关键字，则将该告警信息发往对应的钉钉机器人。
      </p>
      <p>
        启用关键字过滤，但是关键字为空，则认为都不匹配，即任何告警信息都不发往该机器人。
      </p>
      <p>
        如果不启用关键字过滤，则所有告警信息都发往该机器人。即不进行关键字过滤。
      </p>
      <h2>关键字条件</h2>
      <p>以下都是在启用配置的情况下：</p>
      <p>
        可以选择匹配任一个关键字还是匹配全部关键字。关键字可以配置多个以英文逗号分隔，如果是设置匹配任一个，则只要告警信息包含其中任何一个关键字便分发告警信息；如何设置匹配全部，则需要包含全部的关键字。
      </p>
    </div>
  </div>
</template>
<style scoped>
.help {
  text-align: left;
}
</style>
